In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Employee_errors.csv')
df.head()

   employee_id  first_name  last_name  age  gender  department      salary
0            1       JOHN         DOE   35    Male   marketing  50000.6700
1            2       ja ne      smith   28  Female      Saless  60000.0000
2            3  Mic hael      Johnson   42    Male     Finance  70000.6768
3            4     Emily     williams   31  Female          HR  55000.0000
4            5     JaMes        BROwn   37       M  Operations  65000.2200

In [3]:
df.dtypes

employee_id      int64
first_name      object
last_name       object
age              int64
gender          object
department      object
salary         float64
dtype: object

In [4]:
df['first_name'] = df['first_name'].str.lower()
df['first_name'].head()

0         john
1         ja ne
2    mic hael
3       emily
4       james
Name: first_name, dtype: object

In [5]:
df['last_name'] = df['last_name'].str.lower()
df['last_name'].head()

0          doe
1        smith
2      johnson
3     williams
4        brown
Name: last_name, dtype: object

In [6]:
df['first_name'] = df['first_name'].str.replace(' ','')
df['last_name'] = df['last_name'].str.replace(' ','')
df['first_name'].head()

0       john
1       jane
2    michael
3      emily
4      james
Name: first_name, dtype: object

In [7]:
df['first_name'] = df['first_name'].str.strip()
df['last_name'] = df['last_name'].str.strip()
df['first_name'].head()

0       john
1       jane
2    michael
3      emily
4      james
Name: first_name, dtype: object

In [8]:
df['department'].unique()

array(['marketing', 'Saless', 'Finance', 'HR', 'Operations', 'IT',
       'Marketting', 'Sales', 'Marketing'], dtype=object)

In [9]:
def fix_errors(e):
    if e == 'marketing':
        return 'Marketing'
    elif e == 'Saless':
        return 'Sales'
    elif e == 'Marketting':
        return 'Marketing'
    else :
        return e

In [10]:
df['department'] = df['department'].apply(fix_errors)
df['department'].head()

0     Marketing
1         Sales
2       Finance
3            HR
4    Operations
Name: department, dtype: object

In [11]:
df['department'].unique()

array(['Marketing', 'Sales', 'Finance', 'HR', 'Operations', 'IT'],
      dtype=object)

In [12]:
gender = {'Male': 'M', 'Female': 'F', 'male': 'M', 'female': 'F', 'unknown': 'U', 'M': 'M', 'F': 'F', 'U': 'U'}
df['gender'] = df['gender'].map(gender)
df['gender'].head()

0    M
1    F
2    M
3    F
4    M
Name: gender, dtype: object

In [15]:
df['salary'] = df['salary'].round()
df['salary'].head()

0    50001.0
1    60000.0
2    70001.0
3    55000.0
4    65000.0
Name: salary, dtype: float64

In [16]:
df.head()

   employee_id first_name last_name  age gender  department   salary
0            1       john       doe   35      M   Marketing  50001.0
1            2       jane     smith   28      F       Sales  60000.0
2            3    michael   johnson   42      M     Finance  70001.0
3            4      emily  williams   31      F          HR  55000.0
4            5      james     brown   37      M  Operations  65000.0

In [17]:
df.dtypes

employee_id      int64
first_name      object
last_name       object
age              int64
gender          object
department      object
salary         float64
dtype: object